Requests_control/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <comment>Email ответственного</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>Должность ответственного</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылкаИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <comment>Представление ответственного в документах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>ИдентификаторКлиента</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КаталогПрограммы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/CommonModules/ПользователиУчетОбращений/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Пользователи".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает Истина если есть хотя бы один пользователь с ролью ПолныеПрава
Функция ЕстьАдминистратор() Экспорт
	
	ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для каждого Эл Из ВсеПользователи Цикл
		Роли = Эл.Роли;
		Если Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;	

	Возврат Ложь;
	
КонецФункции	

// ВОзвращает Истина если в базе нет ни одного пользователя
Функция ПользователейНет() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает пользователей с ролью ПолныеПравы.
//
// Возвращаемое значение:
//  Массив - Администраторы системы.
//
Функция Администраторы() Экспорт
	
	АдминистраторыИБ = Новый Массив;
	ВсеПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для каждого ПользовательИБ Из ВсеПользователиИБ Цикл
		Роли = ПользовательИБ.Роли;
		Если Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
			АдминистраторыИБ.Добавить(ПользовательИБ.УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ В (&АдминистраторыИБ)";
	Запрос.УстановитьПараметр("АдминистраторыИБ", АдминистраторыИБ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// По части наименования формирует список для выбора пользователей
// Параметры:
//		Текст - часть наименования, по которому выполняется поиск
// Возвращает:
//		СписокЗначений, содержащий ссылки на найденные по части наименования объекты
Функция СформироватьДанныеВыбораПользователя(Текст) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.Должность КАК Должность
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование ПОДОБНО &Текст
	|	И Пользователи.Недействителен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Текст", Текст + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Должность) Тогда 
			ДобавкаТекст = "";
			ДобавкаТекст = СтрШаблон(НСтр("ru = ' (%1)'"), Строка(Выборка.Должность));
			ПредставлениеФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				Строка(Выборка.Ссылка), 
				Новый ФорматированнаяСтрока(ДобавкаТекст, 
					, WebЦвета.Серый)
				);
			ДанныеВыбора.Добавить(Выборка.Ссылка, ПредставлениеФорматированнаяСтрока);
			
		Иначе
			
			ДанныеВыбора.Добавить(Выборка.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

Функция ПолучитьАктуализироватьКлассификатор() Экспорт
	
	Возврат  Константы.АктуализироватьКлассификатор.Получить();
	
КонецФункции

#КонецОбласти
